cf/BusinessProcesses/ОтменаСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ОтменаСборки</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыСобранные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыСобранные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/BusinessProcesses/ОтменаСборки/Ext/ObjectModule.bsl
Процедура ОтменитьСборкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ 	РАЗЛИЧНЫЕ ВЫБОР КОГДА СкладЯчейка ССЫЛКА Справочник.Ячейки ТОГДА СкладЯчейка.Владелец ИНАЧЕ СкладЯчейка КОНЕЦ Склад
	//|ИЗ РегистрНакопления.ОтменаСборкиЗаказа.Остатки(,Заказ = &Заказ)");
	//
	//Запрос.УстановитьПараметр("Заказ", Заказ);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
	//	Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
	//	Задача.БизнесПроцесс 	= Ссылка;
	//	Задача.Склад 			= Выборка.Склад;
	//	Задача.Заказ 			= Заказ;
	//	Задача.Роль				= Справочники.Роли.Кладовщик;
	//	Задача.Наименование 	= "Вернуть товар по заказу " + Заказ.Номер;
	//	Задача.Дата				= ТекущаяДата();
	//	
	//	ФормируемыеЗадачи.Добавить(Задача);	
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Склад, КоличествоОстаток  из РегистрНакопления.ТоварыСобранные.Остатки(, Заказ = &Заказ)";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
		Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
		Задача.БизнесПроцесс 	= Ссылка;
		Задача.Склад 			= Выборка.Склад;
		Задача.Заказ 			= Заказ;
		Задача.Роль				= Справочники.Роли.Кладовщик;
		Задача.Наименование 	= "Вернуть товар по заказу " + Заказ.Номер;
		Задача.Дата				= ТекущаяДата();
		
		ФормируемыеЗадачи.Добавить(Задача);	
	КонецЦикла;
	
	
КонецПроцедуры
